# from polyglot.detect import Detector
#
# from LanguageProcessing.TextAnalysis.PolyglotAnalysis.PolyglotAnalysis import PolyglotAnalysis
#
# arabic_text = u"""
# Слава україні
# """
# detector = Detector(arabic_text)
# print(detector.language.code)
from LanguageProcessing.TextAnalysis.PolyglotAnalysis.PolyglotAnalysis import PolyglotAnalysis

blob = u"""
22 січня підписано Протокол про співпрацю між КПІ ім. Ігоря Сікорського і університетом Чанаккале Онсекіз Март (Турецька Республіка), а також між Науковими парками обох університетів.
КПІ ім. Ігоря Сікорського відвідала делегація університету Чанаккале Онсекіз Март з Турецької Республіки. До складу делегації входили ректор університету Юджел Асер, президент Чанаккале Технопарку Еркан Біль, представники бізнесу та інші.
Університет Чанаккале Онсекіз Март – це турецький державний дослідницький університет, розташований в провінції Чанаккале і прилеглих до неї містах. 
Увійшов до числа 1000 кращих університетів світу в щорічних звітах Scimago Institutions Rankings 2012 року. 
У 2013 році визнаний одним із кращих інноваційних університетів Туреччини. Кількість студентів університету в 2013 році перевищувала 37,5 тисяч.
Від КПІ ім. Ігоря Сікорського з гостями зустрілися проректор з міжнародних зв’язків член-кореспондент НАН України Сергій Сидоренко, 
заступник проректора з міжнародних зв’язків Ксенія Юдкова, заступник проректора з наукової роботи Ігор Литвинов, Генеральний директор Наукового парку «Київська політехніка» Володимир Гнат, представники Механіко-машинобудівного інституту та кількох факультетів.
Після обговорення питань співробітництва сторони підписали Протокол про співпрацю між університетом Чанаккале Онсекіз Март з (Турецька Республіка) 
та КПІ ім. Ігоря Сікорського, а також між Науковими парками обох університетів.
Протоколом, зокрема, передбачено, що співпраця може включати спільні дослідницькі та пілотні проекти, 
обмін науково-педагогічними працівниками, обмін студентами, стажування, організацію спільних семінарів, конференцій, спільні наукові публікації та інше.
"""

pa = PolyglotAnalysis(blob)

print(pa.get_persons())
print(pa.get_locations())
print(pa.get_organizations())


